<?php

return [
    '400' => '非法的请求参数',
    '401' => '授权登录失败',
    '403' => '没有权限执行此操作',
    '404' => '资源没有找到',
    '500' => '操作失败, 请稍后再试',
    '200' => '授权成功！',
    '10001' => '登录失效,请重新登录',
    '10002' => '注册信息有误',
    '10003' => '用户名已被占用',
    '10004' => '请输入用户名与密码',
    '10005' => '用户名或密码错误',
    '10006' => '用户信息填写有误',
    '10007' => '用户授权已注销',
    '10008' => '手机号码未注册',
    '10009' => '短信验证码有效',
    '10010' => '非法手机验证',
    '10011' => '用户被锁定',
    '10012' => '邮箱格式不正确',
    '10013' => '密码已设置',
    '10014' => '密码错误',
    '10015' => '新密码和旧密码相同',
    '10016' => '操作失败',
    '10017' => '验证码不正确',
    '10018' => '用户未授权',

    '20001' => '信息数据不完整',
    '20002' => '搜索条件不正确',
    '20003' => '获取搜索结果失败',

    '200001' => '文件尺寸太大',
    '200002' => '必须上传图片,jpg,png',
    '200003' => '重定义尺寸必须为整形',

    '300003' => '您和您的爱车成功绑定',
    '300004' => '该车已存在绑定',
    '300005' => '您输入的密码不匹配',


];
